## staging: manifest_secrets
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 1 to add, 0 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                              NAME                              |
|----------|----------------------------------------------------------------|
| recreate | `aws_secretsmanager_secret_version.manifest_redis_publish_url` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_secretsmanager_secret_version.manifest_redis_publish_url must be replaced
-/+ resource "aws_secretsmanager_secret_version" "manifest_redis_publish_url" {
      ~ arn                  = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:MANIFEST_REDIS_PUBLISH_URL-wdeQii" -> (known after apply)
      + has_secret_string_wo = (known after apply)
      ~ id                   = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:MANIFEST_REDIS_PUBLISH_URL-wdeQii|terraform-20250626141917446900000001" -> (known after apply)
      ~ secret_string        = (sensitive value) # forces replacement
      ~ version_id           = "terraform-20250626141917446900000001" -> (known after apply)
      ~ version_stages       = [
          - "AWSCURRENT",
        ] -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.manifest_admin_client_secret"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.manifest_auth_tokens"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.manifest_aws_pinpoint_default_pool_id"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.manifest_aws_pinpoint_sc_pool_id"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.manifest_aws_pinpoint_sc_template_ids"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.manifest_aws_route53_zone"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.manifest_aws_ses_access_key"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.manifest_aws_ses_secret_key"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.manifest_cache_clear_client_secret"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.manifest_crm_github_personal_access_token"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.manifest_cypress_auth_client_secret"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.manifest_cypress_user_pw_secret"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.manifest_dangerous_salt"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.manifest_debug_key"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.manifest_docker_hub_pat"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.manifest_docker_hub_username"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.manifest_document_download_api_key"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.manifest_fresh_desk_api_key"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
